---
kind: type
id: T:Autodesk.Revit.DB.IFC.IFCFileWriteOptions
source: html/93533cc5-3687-063d-a80e-d020e869623c.htm
---
# Autodesk.Revit.DB.IFC.IFCFileWriteOptions

This class contains options to write an IFC file.

## Syntax (C#)
```csharp
public class IFCFileWriteOptions : IDisposable
```